of40/tutorials/rheoEFoam/channelEDF/PowerLaw/DebyeHuckel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|phiE|psi|U)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0.;
        minIter          0;
        maxIter          800;
        
    }
 
}

electricControls
{
  phiEEqn
   {
      residuals 1e-7;
      maxIter      1;
   }

  psiEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
}

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
       
    }
}

relaxationFactors
{
    fields
     {        
	p 	1;
     }

    equations
     { 
       U 	1;
     }
}

// ************************************************************************* //
